Autodesk.Revit.DB.Structure.StructuralConnectionSettings.GetStructuralConnectionSettings(Autodesk.Revit.DB.Document)
Obtains the StructuralConnectionSettings object for the specified project document.
document:
A project document.
Returns:
The StructuralConnectionSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017